## Terraform Plan Output for test
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/431fca8d-e614-4268-aa3c-22a2e684933a/resourceGroups/cst8918-final-project-group-2/providers/Microsoft.ContainerService/managedClusters/test-aks"
        name                                = "test-aks"
        tags                                = {
            "environment" = "test"
        }
        # (23 unchanged attributes hidden)

      ~ default_node_pool {
            name                         = "masterpool"
            tags                         = {}
            # (21 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.weather_app.kubernetes_deployment.weather_app will be created
  + resource "kubernetes_deployment" "weather_app" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + name             = "weather-app"
          + namespace        = "weather-app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "1"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "weather-app"
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "weather-app"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "cst8918finalprojectacr.azurecr.io/weather-app:3e9870c144e2323f241d38a56a238e51b0775bde"
                      + image_pull_policy          = (known after apply)
                      + name                       = "weather-app"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env {
                          + name = "WEATHER_API_KEY"

                          + value_from {
                              + secret_key_ref {
                                  + key  = "WEATHER_API_KEY"
                                  + name = "weather-api-secret"
                                }
                            }
                        }

                      + env_from {
                          + config_map_ref {
                              + name = "weather-app-config"
                            }
                        }

                      + liveness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 30
                          + period_seconds        = 10
                          + success_threshold     = 1
                          + timeout_seconds       = 1

                          + http_get {
                              + path   = "/health"
                              + port   = "3000"
                              + scheme = "HTTP"
                            }
                        }

                      + port {
                          + container_port = 3000
                          + protocol       = "TCP"
                        }

                      + readiness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 5
                          + period_seconds        = 5
                          + success_threshold     = 1
                          + timeout_seconds       = 1

                          + http_get {
                              + path   = "/health"
                              + port   = "3000"
                              + scheme = "HTTP"
                            }
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "500m"
                              + "memory" = "512Mi"
                            }
                          + requests = {
                              + "cpu"    = "250m"
                              + "memory" = "256Mi"
                            }
                        }
                    }

                  + image_pull_secrets {
                      + name = "acr-auth"
                    }
                }
            }
        }
    }

  # module.weather_app.kubernetes_secret.acr_auth will be created
  + resource "kubernetes_secret" "acr_auth" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "kubernetes.io/dockerconfigjson"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "acr-auth"
          + namespace        = "weather-app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>